#+TITLE:      Simple and Scalable Microservices: NATS and the Docker tooling
#+property:   header-args :results output :exports both

*** Create a custom network

#+BEGIN_SRC sh
gcloud compute networks create nats-docker --mode custom
#+END_SRC

#+RESULTS:
: NAME         MODE    IPV4_RANGE  GATEWAY_IPV4
: nats-docker  custom

*** Create subnet

#+BEGIN_SRC sh
gcloud compute networks subnets create nats-docker \
  --network nats-docker \
  --range 10.240.0.0/24
#+END_SRC

#+RESULTS:
: NAME         REGION       NETWORK      RANGE
: nats-docker  us-central1  nats-docker  10.240.0.0/24

*** Firewalls

- Allow ping from anywhere

#+BEGIN_SRC sh
gcloud compute firewall-rules create nats-docker-allow-icmp \
  --allow icmp \
  --network nats-docker \
  --source-ranges 0.0.0.0/0 
#+END_SRC

#+RESULTS:
: NAME                    NETWORK      SRC_RANGES  RULES  SRC_TAGS  TARGET_TAGS
: nats-docker-allow-icmp  nats-docker  0.0.0.0/0   icmp

- Allow internal traffic

#+BEGIN_SRC sh
gcloud compute firewall-rules create nats-docker-allow-internal \
  --allow tcp:0-65535,udp:0-65535,icmp \
  --network nats-docker \
  --source-ranges 10.240.0.0/24
#+END_SRC

#+RESULTS:
: NAME                        NETWORK      SRC_RANGES     RULES                         SRC_TAGS  TARGET_TAGS
: nats-docker-allow-internal  nats-docker  10.240.0.0/24  tcp:0-65535,udp:0-65535,icmp

- Allow ssh from anywhere

#+BEGIN_SRC sh
gcloud compute firewall-rules create nats-docker-allow-ssh \
  --allow tcp:22 \
  --network nats-docker \
  --source-ranges 0.0.0.0/0
#+END_SRC

#+RESULTS:
: NAME                   NETWORK      SRC_RANGES  RULES   SRC_TAGS  TARGET_TAGS
: nats-docker-allow-ssh  nats-docker  0.0.0.0/0   tcp:22

- Allow public ip health check monitoring

#+BEGIN_SRC sh
gcloud compute firewall-rules create nats-docker-allow-healthz \
  --allow tcp:8080 \
  --network nats-docker \
  --source-ranges 130.211.0.0/22
#+END_SRC

#+RESULTS:
: NAME                       NETWORK      SRC_RANGES      RULES     SRC_TAGS  TARGET_TAGS
: nats-docker-allow-healthz  nats-docker  130.211.0.0/22  tcp:8080

- Allow API server

#+BEGIN_SRC sh
gcloud compute firewall-rules create nats-docker-allow-api-server \
  --allow tcp:80 \
  --network nats-docker \
  --source-ranges 0.0.0.0/0
#+END_SRC

- NATS Docker network

#+BEGIN_SRC sh
gcloud compute firewall-rules list --filter "network=nats-docker"
#+END_SRC

#+RESULTS:
: NAME                        NETWORK      SRC_RANGES      RULES                         SRC_TAGS  TARGET_TAGS
: nats-docker-allow-healthz   nats-docker  130.211.0.0/22  tcp:8080
: nats-docker-allow-icmp      nats-docker  0.0.0.0/0       icmp
: nats-docker-allow-internal  nats-docker  10.240.0.0/24   tcp:0-65535,udp:0-65535,icmp
: nats-docker-allow-ssh       nats-docker  0.0.0.0/0       tcp:22

*** Public IP Address

#+BEGIN_SRC sh
gcloud compute addresses create nats-docker --region us-central1
#+END_SRC

Confirm

#+BEGIN_SRC sh
gcloud compute addresses list nats-docker
#+END_SRC

#+RESULTS:
: NAME         REGION       ADDRESS          STATUS
: nats-docker  us-central1  AAA.BBB.CCC.DDD  RESERVED

*** Node 0
    :properties:
    :header-args: :dir (docker:infra-ssh "docker-swarm-0") :results output
    :end:

#+BEGIN_SRC sh :exports both
sudo docker swarm init --advertise-addr 10.240.0.10
#+END_SRC

#+RESULTS:
#+begin_example
Swarm initialized: current node (93cb4tot9jvcvn3o2u60fntlz) is now a manager.

To add a worker to this swarm, run the following command:

    docker swarm join \
    --token SWMTKN-1-3dp2fr5m5ycz9daobryhi4kzv82ol3skahy7oqdyczgmjbj0ru-7ltk8rkyei28lz7d07l0fajjr \
    10.240.0.10:2377

To add a manager to this swarm, run 'docker swarm join-token manager' and follow the instructions.

#+end_example

*** Node 1
    :properties:
    :header-args: :dir (docker:infra-ssh "docker-swarm-1") :results output
    :end:

#+BEGIN_SRC sh
sudo docker swarm join \
--token SWMTKN-1-3dp2fr5m5ycz9daobryhi4kzv82ol3skahy7oqdyczgmjbj0ru-7ltk8rkyei28lz7d07l0fajjr \
10.240.0.10:2377
#+END_SRC

#+RESULTS:
: This node joined a swarm as a worker.

*** Node 2
    :properties:
    :header-args: :dir (docker:infra-ssh "docker-swarm-2") :results output
    :end:

#+BEGIN_SRC sh
sudo docker swarm join \
--token SWMTKN-1-3dp2fr5m5ycz9daobryhi4kzv82ol3skahy7oqdyczgmjbj0ru-7ltk8rkyei28lz7d07l0fajjr \
10.240.0.10:2377
#+END_SRC

#+RESULTS:
: This node joined a swarm as a worker.

*** Node 3
    :properties:
    :header-args: :dir (docker:infra-ssh "docker-swarm-3") :results output
    :end:

#+BEGIN_SRC sh
sudo docker swarm join \
--token SWMTKN-1-3dp2fr5m5ycz9daobryhi4kzv82ol3skahy7oqdyczgmjbj0ru-7ltk8rkyei28lz7d07l0fajjr \
10.240.0.10:2377
#+END_SRC

#+RESULTS:
: This node joined a swarm as a worker.

*** Node 4
    :properties:
    :header-args: :dir (docker:infra-ssh "docker-swarm-4") :results output
    :end:

#+BEGIN_SRC sh
sudo docker swarm join \
--token SWMTKN-1-3dp2fr5m5ycz9daobryhi4kzv82ol3skahy7oqdyczgmjbj0ru-7ltk8rkyei28lz7d07l0fajjr \
10.240.0.10:2377
#+END_SRC

#+RESULTS:
: This node joined a swarm as a worker.

